// routes.js
// Система путей: ключ - ID текущего города, значение - массив ID доступных для посещения городов.
// Из каждого города можно попасть строго в два соседних, создавая замкнутую или связанную сеть.

const ROUTES = {
  1: [2, 8], // Ривервуд -> Оукхолл, Дастмир
  2: [1, 3], // Оукхолл -> Ривервуд, Стоунгейт
  3: [2, 4], // Стоунгейт -> Оукхолл, Голдпорт
  4: [3, 5], // Голдпорт -> Стоунгейт, Санкрест
  5: [4, 6], // Санкрест -> Голдпорт, Айронпик
  6: [5, 7], // Айронпик -> Санкрест, Мирфилд
  7: [6, 8], // Мирфилд -> Айронпик, Дастмир
  8: [7, 1]  // Дастмир -> Мирфилд, Ривервуд
};

window.ROUTES = ROUTES;
